app/controllers/championship_controller.rb

INSERT INTO "teams" ("name", "created_at", "updated_at", "points") VALUES('timeA', '2009-10-07 01:44:15', '2009-10-07 01:44:15', 0)
---
	def page_2
		@teams = []
		params[:teams].each do |key, team_name|
			t = Team.new
			t.name = team_name
			@teams << t