app/controllers/phases_controller.rb

SELECT * FROM "phases"
---
  def index
    @phases = Phase.all